Repository: SenaSelvinaz/StockFUI
Catalog: lib/l10n/app_*.arb
Languages: ar, tr

# profileTitle
source: Profile
ar: صفحتي
tr: Profilim

source: App Settings
ar: إعدادات التطبيق
tr: Uygulama Ayarları

# languageSelection
source: Language
ar: اختيار اللغة
tr: Dil Seçimi

source: Logout
ar: تسجيل الخروج
tr: Çıkış Yap

source: Home
ar: الصفحة الرئيسية
tr: Ana Sayfa

source: Profile
ar: الملف الشخصي
tr: Profil

source: Phone Number
ar: رقم الهاتف
tr: Telefon Numarası

source: Role
ar: الدور
tr: Yetki Düzeyi

# namePlaceholder
source: Full Name (Example User)
ar: الاسم الكامل (مستخدم مثال)
tr: Ad Soyad (Örnek Kullanıcı)

# languageChanged
source: Language changed: {language}
ar: تم تغيير اللغة: {language}
tr: Dil değiştirildi: {language}

source: Manager Panel
ar: لوحة المدير
tr: Yönetici Paneli

# recordOperations
source: Worker Registration
ar: تسجيل الموظف
tr: Çalışan Kayıt İşlemleri

source: Stock Control
ar: مراقبة المخزون
tr: Stok Takip

source: Job Tracking
ar: متابعة العمل
tr: İş Takip

source: Operation Reports
ar: تقارير العمليات
tr: İşlem Raporları

# comingSoon
source: {title} will be added soon.
ar: سيتم إضافة {title} قريبًا.
tr: {title} yakında eklenecektir.

source: Worker List
ar: قائمة الموظفين
tr: Çalışan Listesi

source: New Record
ar: سجل جديد
tr: Yeni Kayıt

source: Delete Record
ar: حذف السجل
tr: Kayıt Sil

# enterWorkerName
source: Enter worker's full name
ar: أدخل الاسم الكامل للموظف
tr: Çalışanın adını ve soyadını girin

source: Status
ar: الحالة
tr: Statü

# enterPhone
source: Enter worker's phone number
ar: أدخل رقم هاتف الموظف
tr: Çalışanın telefon numarasını giriniz

source: Save
ar: حفظ
tr: Kaydet

# fillAllFields
source: Please fill all fields
ar: يرجى ملء جميع الحقول
tr: Lütfen tüm alanları doldurun

# invalidPhone
source: Invalid phone number. E.g.: 5xx xxx xx xx
ar: رقم هاتف غير صالح. مثال: 5xx xxx xx xx
tr: Geçersiz telefon numarası. Örn: 5xx xxx xx xx

source: Saving worker...
ar: جاري حفظ الموظف...
tr: Çalışan kaydediliyor...

# confirmSaveTitle
source: Save Confirmation
ar: تأكيد الحفظ
tr: Kayıt Onayı

source: Cancel
ar: إلغاء
tr: İptal

source: OK
ar: موافق
tr: Tamam

# searchHint
source: Search by phone/name 5xx xxxxxxx
ar: ابحث بالهاتف/الاسم 5xx xxxxxxx
tr: Telefon numarası/ad soyad ile ara 5xx xxxxxxx

# noRecords
source: No records found
ar: لم يتم العثور على سجلات
tr: Kayıt bulunamadı

# deleting
source: Deleting record...
ar: جاري حذف السجل...
tr: Kayıt siliniyor...

# deleteConfirmTitle
source: Delete Confirmation
ar: تأكيد الحذف
tr: Silme Onayı

# deleteConfirmMessage
source: Are you sure you want to delete this person?
ar: هل أنت متأكد أنك تريد حذف هذا الشخص؟
tr: Bu kişiyi silmek istediğinize emin misiniz?

source: Yes, Delete
ar: نعم، احذف
tr: Evet, Sil

# recordDeleted
source: Worker deleted successfully.
ar: تم حذف الموظف بنجاح.
tr: Çalışan başarıyla silindi.

# errorOccurred
source: An error occurred
ar: حدث خطأ
tr: Bir hata oluştu

# onlyAdmins
source: Only admins can perform this action.
tr: Bu işlemleri sadece yönetici yapabilir.

# statusManagement
source: Management
ar: الإدارة
tr: Yönetim

# statusPurchasing
source: Purchasing Department
ar: قسم الشراء
tr: Satın Alma Birimi

# statusProductPlanning
source: Product Planning Manager
ar: مسؤول تخطيط المنتج
tr: Ürün Planlama Sorumlusu

# statusCraftsman
source: Craftsman
ar: حرفي
tr: Usta

# statusForeman
source: Foreman
ar: رئيس العمال
tr: Ustabaşı

source: Cutting
ar: تقطيع
tr: Kesim

source: Drilling
ar: حفر
tr: Delikleme

source: Packaging
ar: تغليف
tr: Paketleme

source: Welding
ar: لحام
tr: Kaynak

# workerNameLabel
source: Name
ar: الاسم
tr: İsim
